The rail path is closed at the start and end path point for extension creation.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId RailPathCloseLoopForExtensionWarning { get; }
  Visual Basic
Public Shared ReadOnly Property RailPathCloseLoopForExtensionWarning As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ RailPathCloseLoopForExtensionWarning {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures StairRampFailures Class
  Autodesk.Revit.DB Namespace